OpenFOAM-13/tutorials/incompressibleFluid/motorBikeSteady/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forceCoeffs;
libs            ("libforces.so");

writeControl    timeStep;
timeInterval    1;

log             yes;

patches         (motorBikeGroup);

rho             rhoInf;      // Indicates incompressible
rhoInf          1;           // Redundant for incompressible
liftDir         (0 0 1);
dragDir         (1 0 0);
CofR            (0.72 0 0);  // Axle midpoint on ground
pitchAxis       (0 1 0);
magUInf         20;
lRef            1.42;        // Wheelbase length
Aref            0.75;        // Estimated

/*
binData
{
    nBin        20;          // output data into 20 bins
    direction   (1 0 0);     // bin direction
    cumulative  yes;
}
*/


// ************************************************************************* //
